#include <delay.h>
#include <mega16.h>

#define OW_DDR DDRB
#define OW_PIN PINB
#define OW_BUS 4



//------------------------------------------------------------------------------
//                          Инициализация
//------------------------------------------------------------------------------
char iB_Presence(void)
{
  char nalichie_ustroystva = 0;
  OW_DDR |= (1<<OW_BUS);
  delay_us(500);
  OW_DDR &= ~(1<<OW_BUS);
  delay_us(90);
  if((OW_PIN&0x01)== 0)
    {
      nalichie_ustroystva = 1;
    }
  delay_us(200);
  return nalichie_ustroystva;
}
//------------------------------------------------------------------------------




//------------------------------------------------------------------------------
//                         Запись на шину 1
//------------------------------------------------------------------------------
void Wire1_WriteBit1(void)
{
  OW_DDR |= (1<<OW_BUS);  // устанавливаем шину в 0;
  delay_us(3);            // выжидаем не менее чем 1 мкс;
  OW_DDR &= ~(1<<OW_BUS); // освобождаем шину;
  delay_us(60);           // задержка окончания таймслота;
}
//------------------------------------------------------------------------------




//------------------------------------------------------------------------------
//                         Запись на шину 0
//------------------------------------------------------------------------------
void Wire1_WriteBit0(void)
{
  OW_DDR |= (1<<OW_BUS);  // устанавливаем шину в 0;
  delay_us(60);            // удерживае мшину в 0 60 мкс;
  OW_DDR &= ~(1<<OW_BUS); // освобождаем шину;
  delay_us(3);           // задержка окончания таймслота;
}
//------------------------------------------------------------------------------




//------------------------------------------------------------------------------
//                      Посылка байта на шину
//------------------------------------------------------------------------------
void Wire1_SendByte(char byte)
{
    char count = 0;
  for( count = 0; count < 8; count ++)
     {
       // выводим очередной бит начиная с младшего;
       if(byte & 0x01)
         {
           Wire1_WriteBit1();
         }
       else 
         {
           Wire1_WriteBit0();
         }
       byte >>= 1;  //сдвигаем данные вправо;
     }
}
//------------------------------------------------------------------------------




//------------------------------------------------------------------------------
//                     Приём бита с шины
//------------------------------------------------------------------------------
char OW_ReadBit(void)
{
  char Bit;
  OW_DDR |= (1<<OW_BUS);  // устанавливаем шину в 0;
  delay_us(3);            // выжидаем не менее чем 1 мкс;
  OW_DDR &= ~(1<<OW_BUS); // освобождаем шину;
  delay_us(11);           // ожидание удержания сигнала датчиком;
  Bit = (OW_PIN&0x01);           // считывание состояния шины;
  delay_us(55);           // задержка окончания таймслота;
  return Bit;
}
//------------------------------------------------------------------------------




//------------------------------------------------------------------------------
//                     Приём байта с шины
//------------------------------------------------------------------------------
char Wire1_ReadByte(void)
{
  char Byte=0x00, count;
  for( count = 0; count < 8; count ++)
  {
    Byte >>= 1;
    if(OW_ReadBit())
    {
      Byte |= 0x80;
    }
  }
  return Byte;
}
//------------------------------------------------------------------------------



