//***************************************************************************
//
//  Description.: драйвер 4-ех кнопочного джойстика
//
//  Data........: 25.10.09
//
//***************************************************************************
#ifndef	BUTTONS_h
#define	BUTTONS_h

//#include <ioavr.h>

//порт, к которому подключены кнопки
#define PORT_BUTTON 	PORTB
#define PIN_BUTTON 	    PINB
#define DDRX_BUTTON 	DDRB

//номера выводов, к которым подключены кнопки
#define BUTTON_1 		3
#define BUTTON_2 		4
#define BUTTON_3		6
#define BUTTON_4 		4

//коды, которые будут записываться в буфер
#define KEY_NULL      0
#define KEY_BUTTON_1  1
#define KEY_BUTTON_2  2
#define KEY_BUTTON_3  3
#define KEY_BUTTON_4  4

//сколько циклов опроса кнопка должна удерживаться
#define THRESHOLD 5

#pragma used+
/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       инициализация портов ввода/вывода
*                   вызывается обычно в начале main`a
****************************************************************************/
void BUT_Init(void);

/**************************************************************************
*   Function name : BUT_Debrief
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       опрашивает кнопки. вызывается обычно из прерывания
*                   если кнопка нажата в течении 20 прерываний,
*                   ее номер записывается в буфер
****************************************************************************/
void BUT_Debrief(void);

/**************************************************************************
*   Function name : BUT_GetKey
*   Returns :       номер нажатой кнопки
*   Parameters :    нет
*   Purpose :       возвращает содержимое кнопочного буфера
*                   при этом буфер очищается
*                   вызывается обычно в main`e в цикле while
*
****************************************************************************/
unsigned char BUT_GetKey(void);


/**************************************************************************
*   Function name : BUT_Init
*   Returns :       нет
*   Parameters :    номер кнопки
*   Purpose :       записывает в кнопочный буфер значение
*                   требуется иногда для имитации нажатия кнопок
****************************************************************************/
void BUT_SetKey(unsigned char key);
#pragma used-

#endif //BUTTONS_H
